[
  {
    "title": "BASIS Game Development and Career Workshop",
    "description": "BASIS is going to organise an workshop designed to provide growth opportunities for technology enthusiasts. In partnership with IUT Computer Society(IUTCS) & IUT Career and Business Society (IUTCBS) , an enlightening series of workshops focused on Game Development, XR, and NFT is set to commence. As the national trade body for Bangladesh's Software & IT Enabled Service industry, BASIS is poised to deliver insights, perspectives, and pathways that can shape the trajectories of aspiring individuals.\n\nStudents can gain insights into the diverse opportunities and promising future prospects that await in this dynamic field. An in-depth understanding of the meticulously structured learning path, which lays the foundation for a successful career in Game Development, will be a focal point of the workshop. Moreover, the event will feature inspirational narratives shared by distinguished alumni of IUT who have made indelible contributions to the continuously evolving landscape of the industry. These workshop segments collectively offer attendees a holistic view of the Game Development domain and its potential for growth and innovation.\n\nIUTCS cordially invites everyone to join this enlightening workshop to uncover the intricacies of career paths, future potentials, and learning pathways within the domain.",
    "timestamp": "2023-08-23",
    "image": "basis_game_dev.jpg"
  },
  {
    "title": "Competitive Programming Classes For Batch 22",
    "description": "IUT Computer Society has organized an introductory session to inaugurate its weekly Competitive Programming classes for Batch 22. The event is scheduled for August 16, 2023, at 2:30 PM and will be held at the IUT Auditorium.\n\nWe extend a warm invitation to all programming enthusiasts from Batch 22 to partake in this session, where we will delve into the realm of problem-solving.\n\nIt is imperative to note that this event is not exclusive to the students of the CSE department. Individuals from all departments who are keenly interested in programming and problem-solving are welcome to join.\n\nEvent Details\nDate: Wednesday, August 16th\nTime: 2:30 PM\nLocation: IUT Auditorium\nAudience: All Batch 22 students",
    "timestamp": "2023-08-16",
    "image": "cp-classes-for-22.jpg"
  },
  {
    "title": "Exploring Research Collaboratoin & Unlocking Your Future in USA",
    "description": "The Department of Computer Science and Engineering (CSE) is excited to announce a special seminar on July 25, 2023, at 11 AM titled Exploring Research Collaboratoin & Unlocking Your Future in USA.\n\nDistinguished speakers, Dr. Md Tariqul Islam and Dr. Tarannum Shaila Zaman, will be joining us to share their expertise in cutting-edge topics:\n\nDr. Md Tariqul Islam, Assistant Professor of Trustworthy Cyberspace at Syracuse University, USA, will present on \"Security, Privacy, and Trust in Distributed Computing Systems (e.g., Cloud, IoT, VNET, and Blockchain).\"\n\nDr. Tarannum Shaila Zaman, Assistant Professor at SUNY Polytechnic Institute, USA, will deliver a talk titled \"Testing, Debugging Modern Software Systems Leveraging Data Mining and NLP.\"\n\nDon't miss out on this exceptional opportunity to enhance your knowledge and explore potential collaborations. Mark your calendars for July 25th at 11 AM and join us for this enlightening event. See you there!",
    "timestamp": "2023-07-22",
    "image": "Exploring-Research-Collaboratoin-&-Unlocking-Your-Future-in-USA.jpg"
  },
  {
    "title": "Integrating Natural Language With Informations Visualisations",
    "description": "IUT Computer Society is going to arrange a webinar emphasizing on “Integrating Natural Language with Information Visualizations” with Dr. Enamul Hoque Prince, Director and Assistant Professor of the School of Information Technology, York University.\n\nNatural language and visualization are two powerful complementary modalities for communicating data insights. While visualizations can be very effective in finding patterns, trends, and outliers in data, natural language can help explain the key points in visualizations and enable users to express their complex information needs about data naturally.\n\nThe session will primarily focus on how to tightly integrate state-of-the-art natural language processing (NLP) and visualization (Vis) techniques to support a diverse range of users with different skills and backgrounds in performing data analysis tasks. Several NLP tasks for Vis will be introduced, including automatic natural language interactions with visualizations, chart question answering, and chart summarization. Besides, there will be demonstrations of several applications that leverage such NLP tasks to make data visualizations and analytics more accessible and inclusive.\n\nDr. Enamul was a postdoctoral fellow in Computer Science at Stanford University. His research addresses the challenges of the information overload problem using an interdisciplinary lens, combining information visualization and human-computer interaction with natural language processing. Since his research is uniquely positioned at the intersection of information visualization, NLP, and HCI, he regularly publishes in top venues in each of these areas, including IEEE Vis, ACL, EMNLP, CHI, IUI, and UIST. He serves as an Area Chair for the ACL Rolling Review (2021-present) and as a program committee member (2018-present) for the IEEE Vis. His research has been funded by NSERC Canada, Canada Foundation for Innovation, and National Research Council Canada, among others.\n\nStudents will be able to learn about data science and NLP and know about its applications in great depth. For those pursuing research work and potential higher studies abroad, Dr. Enamul is the person to gather information from, as he has been highly involved and successful in this field. The goal of the webinar is to benefit students and elevate their zeal to learn about NLP and associated topics, as its demand is on the rise with huge possibilities in the near future.\nWebinar Link- https://bdren.zoom.us/j/62430685800\n\nCaption by Rezwan Islam Salvi (CSE '20)\nIllustration by Kazi Jarif (CSE '20)",
    "timestamp": "2023-07-07",
    "image": "Integrating-Natural-Language-With-Informations-Visualisations.jpg"
  },
  {
    "title": "The strategies to implement blockchain solutions",
    "description": "IUT Computer Society is going to arrange a seminar focusing on “The strategies to implement blockchain solutions” with Md. Muhtaseen Hafiz, Unit Head of Blockchain Division, Technohaven Company Ltd.\n\nBlockchain implementation aims to help companies leverage blockchain-based solutions that introduce decentralized data storage and processing, guarantee data immutability and integrity, and offer effective workflow automation. It helps in the verification and traceability of multistep transactions. By significantly reducing paperwork and errors, blockchain minimizes overhead and transaction costs, and eliminates the need for third parties to verify transactions.\n\nEager to learn about blockchain and its strategies? Join us live on 27th June, tomorrow at 7 pm.\n\nWebinar Link- https://bdren.zoom.us/j/64623737057",
    "timestamp": "2023-06-26",
    "image": "The-strategies-to-implement-blockchain-solutions.jpg"
  },
  {
    "title": "Resource Allocation and Scheduling Algorithmic Aspects",
    "description": "IUTCS will be hosting a seminar titled \"Resource Allocation and Scheduling: Algorithmic Aspects\" with Dr. Salimur Choudhury, Associate Professor at Queen's University, Canada.\n\nDr. Choudhury will be giving a talk about research projects conducted at his Global Optimization, Analytics, and Learning (GOAL) Research Lab, which will cover optimization, analytics, and learning. Additionally, he will also talk about his personal journey from IUT to his current position as a faculty member at a top Canadian university.\n\nOur honorable guest, Dr. Choudhury, the leader of the GOAL Research Group, joined the School of Computing at Queen’s University in January 2023. He brings with him a wealth of experience in designing algorithms for optimization problems. His research has been published in several top-tier conferences and journals, and he has received numerous research grants from government agencies, not-for-profits, and private industries, including some based in Kingston, ON. In fact, several industries have already adopted solutions proposed by Dr. Choudhury and his research group. Dr. Choudhury's contributions to the field have not gone unnoticed, as he was recently awarded the Lakehead University Research Excellence Award in 2021 for his work in combinatorial optimization. We are excited to have him as a guest speaker to share his valuable insights and experience in one of the major branches of computer science.\n\nIUTCS cordially invites you all to join the session. Along with the great insights and knowledge, refreshments will be provided for all participants.\n\nFill out this form to participate, response deadline 04,May 11:59PM :\nhttps://forms.gle/zSqtru8KG4BdDuAB6\nDate: 08.05.2023\nTime: 3:00 PM\nRoom: 301 (2nd Academic Building)",
    "timestamp": "2023-05-04",
    "image": "Resource-Allocation-and-Scheduling-Algorithmic-Aspects.jpg"
  },
  {
    "title": "ML Beyond Academia",
    "description": "The department of CSE is going to arrange a seminar focusing on the industry applications of Machine Learning on 15th March 2023.\n\nTitle: 'ML Beyond Academia'\nSpeakers: Mohammad Sabik Irbaz and Saad Bin Ashraf\nPlace: Room 301 at 2PM\nTarget audience: Anyone who is really interested in this topic! (not limited to CSE students)\n\nInterested persons should fill out this form: https://forms.gle/MZFSBk6bNkvj7kFE9\n\nBio_Speaker1: Mohammad Sabik Irbaz is a graduate of the Islamic University of Technology and an incoming Ph.D. student at George Mason University with 5 published conference papers in different conferences around the world. He has 3 years of experience in ML positions ranging from Lead ML Engineer to Full-Stack Data Scientist in organizations like Pioneer Alpha, Omdena, and Leadbook. Currently, he is working with MasterCourse to build one of the best E-Learning platforms for industry-grade data science to foster the growth of future ML engineers and data scientists.\n\nBio_Speaker2: Saad Bin Ashraf graduated from the Islamic University of Technology in 2021. With 2 years of experience in AI, he is currently a Software Engineer II in AI/ML at infolytx. Being a Full-Stack Machine Learning Engineer, he is involved in the whole lifecycle of an ML project. He has experience in developing production-grade NLP and computer vision engines, as well as projects in finance, management, clothing, and restaurant chains for US and domestic clients.\n\nA brief outline of the session:\n1) Introduction: We will briefly introduce the differences between ML practices in academia and industry and why it's important to bridge the gap.\n2) ML in Academia: We will discuss the different areas of ML research that are typically focused on in academia, such as theory, algorithms, and evaluation metrics.\n3) ML in Industry: We will discuss the different areas of ML that are typically applied in the industry, such as data preparation, deployment, and production monitoring.\n4) Differences Between ML in Academia and Industry: Next, we will discuss some of the key differences between ML practices in academia and industry, such as the focus on practical applications, scalability, and efficiency.\n5) Bridging the Gap: Here, we will provide some practical strategies for bridging the gap between ML in academia and industry, such as internships, collaborative research projects, collaborative industry projects, and attending industry conferences.\n6) Preparing for a Career in ML: Next, we will provide some advice for students on what they can do during their academic career to prepare for a career in ML, such as taking courses in practical skills, working on real-world projects, and building a professional network.\n7) Q&A: The session will end with a Q&A session where students can ask questions and get more information on the topics covered.\n\nRegards.",
    "timestamp": "2023-05-14",
    "image": "ML-Beyond-Academia.jpg"
  }
]
